
// VARIABLES(OЗГОРМОЛОР)
/* 
Текстер ("Салам Дуйно")
Сандар(10,2.5)
Чын же жалган*/
// Текст менен жазылгандардын тиби "String" д.а.
// a - бул озгормонун аталышы
// "Cалам Дуйно"- бул озгормонун мааниси;
// ";"-бул бутушу


void main() {
  String a = "Салам Дуйно";
  int b = 10;              //int-сандар
double c = 2.5;          //double-болчок сандар
bool d = true;         //bool-чын же жалган
bool e = false;
  print("Бул жазуу: $a");
  print("Бул жазуу: $b");
  print("Бул жазуу: $c");
  print("Бул жазуу: $d");
  print("Бул жазуу: $e");
}



